"""
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
На числовой прямой даны три отрезка: P = [257, 356], Q = [5, 600] и R = [59, 228].
Какова наименьшая длина отрезка A, при котором формула
((x ∈ R) → (x ∈ A)) v ((ДЕЛ(x, 3) → (x ∈ P)) → ((x ∈ Q) → (x ∈ A)))
тождественно истинна, то есть принимает значение 1 при любом значении переменной х?
"""

def f(x,a1,a2):
    P = 257<=x<=356
    Q = 5 <= x <= 600
    A = a1<= x <= a2
    R = 59 <= x <= 228
    return ((R) <= (A)) or ((x%3==0) <=(P)) <= ((Q) <=(A))

ox = [y for x in (257,356,5,600,59,228) for y in (x,x+0.01,x-0.01)]

m=[]
for a1 in ox:
    for a2 in ox:
        if a2>a1 and all(f(x,a1,a2) ==1 for x in ox):
            m.append(a2-a1)
print(min(m))
#A тут 168